app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "status" = ? WHERE "users"."id" = ?  [["updated_at", "2021-12-19 20:20:46.466790"], ["status", "enabled"], ["id", 1]]
UPDATE "users" SET "updated_at" = ?, "perm" = ? WHERE "users"."id" = ?  [["updated_at", "2021-12-19 20:20:46.529109"], ["perm", "user"], ["id", 1]]
UPDATE "users" SET "updated_at" = ?, "username" = ? WHERE "users"."id" = ?  [["updated_at", "2021-12-19 20:20:46.598395"], ["username", "User"], ["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."perm" = ? LIMIT ?  [["perm", "admin"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "perm" = ? WHERE "users"."id" = ?  [["updated_at", "2021-12-19 20:20:46.684188"], ["perm", "admin"], ["id", 1]]
---
    def get_current_status
        return if user_session.nil?
        user = User.find(current_user.id)
        if ! user.status
            user.status = 'enabled'
            user.save
        end
        if ! user.perm
            user.perm = 'user'
            user.save
        end
        if ! user.username
            user.username = 'User'
            user.save
        end
        if ! User.find_by_perm('admin')
            user.perm = 'admin'
            user.save