app/controllers/update_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "username" = ? WHERE "users"."id" = ?  [["updated_at", "2021-12-19 20:21:08.661629"], ["username", "John Gustafson"], ["id", 1]]
---
    def username
        if params[:username]
            username = params[:username]
            user = User.find(current_user.id)
            user.username = username
            user.save